# PathShapeFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..PathShapeFailure Property
BuiltInFailures..::..RebarFailures Class See Also
---
Can't solve Rebar Shape in Path Reinforcement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PathShapeFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathShapeFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PathShapeFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace